full diagram
